
export const PRODUCTS = [
  {
    categoryId: 1,
    id: 11,
    name: 'Джонатан Свифт «Путешествия Гулливера',
    price: '100$',
    image: 'https://cv4.litres.ru/pub/c/elektronnaya-kniga/cover_415/5311241-dzhonatan-svift-puteshestviya-lemuelya-gullivera.jpg',
    description: 'Страницы этой книги раскроют перед Вами захватывающую историю приключений английского врача и путешественника Лемюэля Гулливера, придуманную британским писателем Джонатаном Свифтом.'
  },
  {
    categoryId: 1,
    id: 12,
    name: 'Последний оракул',
    price: '100$',
    image: 'https://cv8.litres.ru/pub/c/elektronnaya-kniga/cover_415/330682-dzheyms-rollins-posledniy-orakul.jpg',
    description: 'Нищий оборванец, застреленный снайпером у самых дверей штаб-квартиры спецотряда «Сигма», успевает передать коммандеру Грею Пирсону старинную греческую монету с изображением храма Дельфийского оракула. Убитый опознан: это Арчибальд Полк, входивший в сообщество элитных ученых, известное под названием «Ясоны».'
  },
  {
    categoryId: 1,
    id: 13,
    name: 'Зеленая Миля',
    price: '100$',
    image: 'https://cv5.litres.ru/pub/c/elektronnaya-kniga/cover_415/119255-stiven-king-zelenaya-milya-119255.jpg',
    description: '«Зеленая миля» – культовый роман Стивена Кинга. Читателям предстоит переместиться в страшный мир тюремного блока смертников. Убийцы, маньяки и психопаты в блоке Е ждут своего последнего часа, а работающие там надзиратели – либо садисты, либо очень несчастные люди. '
  },
  {
    categoryId: 1,
    id: 14,
    name: 'Артемис Фаул. Парадокс времени',
    price: '100$',
    image: 'https://cv3.litres.ru/pub/c/elektronnaya-kniga/cover_415/7528730-yon-kolfer-artemis-faul-paradoks-vremeni.jpg',
    description: 'Пока Артемис Фаул спасал демонов на Гибрасе, жизнь у него дома шла своим чередом. По возвращении юный гений обнаружил, что за три года отсутствия обзавелся двумя братцами-близнецами. Родители счастливы снова обрести сына, однако семейная идиллия длится недолго: мать Артемиса тяжело заболевает.'
  },
  {
    categoryId: 1,
    id: 15,
    name: 'Владыка Марса',
    price: '100$',
    image: 'https://cv4.litres.ru/pub/c/elektronnaya-kniga/cover_415/125545-edgar-berrouz-vladyka-marsa.jpg',
    description: 'Роман завершает трилогию, начатую романами «Принцесса Марса» и «Боги Марса». Джон Картер отправляется в долину Исса. Близится время открытия храма, где заточены Файдора — дочь Матаи Шанга, Дея Торис и Тувия Птарса.'
  },
  {
    categoryId: 1,
    id: 16,
    name: 'Космическая Одиссея',
    price: '50$',
    image: 'https://cv8.litres.ru/pub/c/elektronnaya-kniga/cover_415/10323688-artur-klark-kosmicheskaya-odisseya.jpg',
    description: 'Роман «2001: Космическая Одиссея», положивший начало целому циклу, был написан Артуром Кларком на основе собственного сценария к одноименному фильму Стэнли Кубрика, ставшему культовым для многих поколений зрителей. В романе писатель умышленно переставляет акценты, являя читателю новое, оригинальное произведение о силе человеческого духа и интеллекта. Философская глубина, оригинальность идей, крепкая научная составляющая и простой поэтичный язык – эти достоинства превратили книгу сэра Артура Кларка в шедевр, навсегда сделавший его Фантастом Номер Один.'
  },
  {     id: 21,
        name: 'Оно',
        price: '45$' ,
        description: 'Волна страшных убийств захватила небольшой американский город Дерри. Один за одним погибают дети, но полиция бессильна. Маньяк не оставляет следов, нет ни единой зацепки.',
        image: 'https://cv2.litres.ru/pub/c/elektronnaya-kniga/cover_415/122126-stiven-king-ono-122126.jpg',
        categoryId: 2
    },
    {
        id: 22,
        name: 'Кладбище домашних животных',
        price: 4000 ,
        description: 'Казалось бы, семейство Крид – это настоящее воплощение «американской мечты»: отец – преуспевающий врач, красавица мать, прелестные дети. Для полной идиллии им не        хватает лишь большого старинного дома, куда они вскоре и переезжают.',
        image: 'https://cv0.litres.ru/pub/c/elektronnaya-kniga/cover_185/27442307-stiven-king-kladbische-domashnih-zhivotnyh-27442307.jpg',
        categoryId: 2
    },
    {
        id: 23,
        name: 'Нечто из Норт Ривер',
        price: 3490 ,
        description: 'Я тяжело переживал уход на пенсию своего напарника. Мы были вместе целых пятнадцать лет. Уговоры были напрасны, Боб давно решил перебраться на побережье океана. А моя жизнь уже никогда не будет прежней…',
        image: 'https://cv1.litres.ru/pub/c/audiokniga/cover_415/51810812-kristian-vind-nechto-iz-nort-river-51810812.jpg',
        categoryId: 2
    },
    {
        id: 24,
        name: 'Мертвая зона',
        price: 3790,
        description: 'Джонни Смит вел тихую жизнь в маленьком городке. У него была любимая работа, невеста и мама, о которой он заботился. Но автокатастрофа повернула его жизнь на 360 градусов…',
        image: 'https://cv3.litres.ru/pub/c/elektronnaya-kniga/cover_185/4387335-stiven-king-mertvaya-zona-4387335.jpg',
        categoryId: 2
    },
    {
        id: 25,
        name: 'Противостояние',
        price: 4190 ,
        description: 'Из секретной лаборатории вырвался на свободу опаснейший вирус. Умерли сотни тысяч, миллионы ни в чем не повинных людей… Однако и это еще не все. Вступили в игру беспощадные и могучие силы. ',
        image: 'https://cv3.litres.ru/pub/c/audiokniga/cover_330/48409138-stiven-king-protivostoyanie-16-iunya-4-iulya-1990-tom-1-48409138.jpg',
        categoryId: 2
    },
    {
        id: 26,
        name: 'Глаз мертвеца',
        price: 5860 ,
        description: 'Легенда об огненном человеке гласит: «Он может кое-что подарить, например свою руку или глаз… И тогда тот, кто взял его подарок, сможет сжечь своего врага. Только за все придется платить…» Но Сашка ничего этого не знал, он просто хотел, чтобы его обидчики получили по заслугам!',
        image: 'https://cv5.litres.ru/pub/c/elektronnaya-kniga/cover_415/3938655-anna-voronova-glaz-mertveca.jpg',
        categoryId: 2
    },
    {
      id:31, 
      name:'После',
      price: 3050,
      description:'Наивная, невинная и застенчивая Тесса поступает в престижный колледж, исполняя заветную мечту матери. Девушка твердо намерена прилежно учиться, а если повезет ‒ найти друзей, с которыми можно весело проводить время',
      image:'https://cv8.litres.ru/pub/c/elektronnaya-kniga/cover_185/8885781-anna-todd-posle.jpg',
      categoryId: 3
  },
  {
      id:32, 
      name:'Сумерки',
      price: 2500,
      description:'Влюбиться в вампира… Это страшно? Это романтично…',
      image:'https://cv5.litres.ru/pub/c/elektronnaya-kniga/cover_185/178054-stefani-mayer-sumerki-178054.jpg',
      categoryId:3
  },
  {
      id:33, 
      name:'До встречи с тобой',
      price:2750 ,
      description:'Лу Кларк знает, сколько шагов от автобусной остановки до ее дома. Она знает, что ей очень нравится работа в кафе и что, скорее всего, она не любит своего бойфренда Патрика. Но Лу не знает, что вот-вот потеряет свою работу и что в ближайшем будущем ей понадобятся все силы, чтобы преодолеть свалившиеся на нее проблемы.',
      image:'https://cv7.litres.ru/pub/c/audiokniga/cover_250/10804979-dzhodzho-moyes-do-vstrechi-s-toboy-10804979.jpg',
      categoryId:3
  },
  {
      id:34, 
      name:'Последния камелия',
      price:2460 ,
      description:'Главные герои книги – Рози и Алекс. Они лучшие друзья с самого детства, между ними нет никаких секретов и тайн. Из маленьких мальчика и девочки они, повзрослев, превращаются в прекрасного парня и девушку, которые могли бы стать идеальной парой. Но злодейка-судьба распорядилась иначе: на выпускной Рози получает приглашение быть парой самого популярного парня в школе, а Алекс уезжает учиться в другую страну…',
      image:'https://cv8.litres.ru/pub/c/elektronnaya-kniga/cover_185/11951881-sara-dzhio-poslednyaya-kameliya.jpg',
      categoryId: 3
  },
  {
      id:35, 
      name:'С любовью, Рози',
      price:2860 ,
      description:'Юная Флора живет в 40-х годах и страстно любит цветы. Поэтому она с радостью соглашается на предложение таинственного цветочного вора отыскать в саду старинного особняка необычную камелию.',
      image:'https://cv2.litres.ru/pub/c/elektronnaya-kniga/cover_415/489425-sesiliya-ahern-s-lubovu-rozi.jpg',
      categoryId: 3
},
{
      id:36, 
      name:'Крылья',
      price:3250,
      description:'Семнадцатилетняя Лика Вернер после покушения на ее жизнь обнаруживает, что в состоянии стресса может ненадолго перемещаться в тела других людей. Лика уверена, что сходит с ума, пока не встречает человека, который подозрительно хорошо осведомлен о такого рода «симптомах».',
      image:'https://cv8.litres.ru/pub/c/elektronnaya-kniga/cover_415/17086887-kristina-stark-krylya-17086887.jpg',
      categoryId: 3
},
  {
      id:41, 
      name:'Князь тьмы и я',
      price:2560 ,
      description:'В мире, где даже полицейские чувствуют себя незащищенными и слабыми, правят вампиры. Они главенствуют над нами потому, что сильны, могущественны и коррумпированы.',
      image:'https://cv2.litres.ru/pub/c/elektronnaya-kniga/cover_200/43181124-elena-zvezdnaya-knyaz-tmy-i-ya.jpg',
      categoryId:4
  },
  {
      id:42, 
      name:'Оружие возмездия',
      price:2890 ,
      description:'Федерация совместно с кваргами и ящерами готовится к полномасштабному вторжению в пространство жаберов. Советом глав государств адмирал Игорь Лавров назначается главнокомандующим объединенным флотом. Его ждет сверхсложная задача: спланировать и провести стратегическую операцию по захвату территории жаберов и принудить их сдаться.',
      image:'https://cv2.litres.ru/pub/c/elektronnaya-kniga/cover_185/43000323-maks-alekseevich-glebov-oruzhie-vozmezdiya.jpg',
      categoryId:4
  },
  {
      id:43, 
      name:'Иллюзия игры',
      price:1570 ,
      description:'Все герои истории – в прошлом мошенники. Один из них уже смирился с тем, что пора бы уйти на покой, если б не неожиданная удача – невероятных способностей девушка, да еще к тому же и потрясающей красоты и ума. Вот с кем надо идти на большое дело! И тут азарт снова начинает кипеть в жилах старика, а в глазах снова вспыхивает огонь.',
      image:'https://cv9.litres.ru/pub/c/elektronnaya-kniga/cover_185/608995-elena-mihalkova-illuziya-igry.jpg',
      categoryId:4
  },
  {
    id:44, 
    name:'Тобол. Много званых',
    price:1570 ,
    description:'Немолодой Петр I с досадой пинает тело висельника, шаман проводит кровавые обряды, каторжники сбивают ноги о бездорожье… И все они сойдутся в Сибири. В сердце и плавильном котле молодой империи…',
    image:'https://cv6.litres.ru/pub/c/elektronnaya-kniga/cover_415/22075169-aleksey-ivanov-tobol-mnogo-zvanyh.jpg',
    categoryId:4
},
{
    id:45, 
    name:'Мотылек',
    price:5570 ,
    description:'Бывают книги просто обреченные на успех. Автобиографический роман Анри Шарьера «Мотылек» стал бестселлером сразу после его опубликования в 1969 году. В первые три года после выхода в свет было напечатано около 10 миллионов экземпляров этой книги. Кинематографисты были готовы драться за право экранизации. В 1973 году состоялась премьера фильма Франклина Шеффнера, снятого по книге Шарьера (в главных ролях Стив Маккуин и Дастин Хоффман), ныне по праву причисленного к классике кинематографа.',
    image:'https://cv1.litres.ru/pub/c/elektronnaya-kniga/cover_415/6665716-anri-sharer-motylek-2.jpg',
    categoryId:4
},
{
    id:46, 
    name:'Вокруг света за 80 дней (спектакль)',
    price:5570 ,
    description:'Как сделать невероятное – очевидным, преодолеть пространство и покорить время, выиграть пари, сказочно разбогатеть, жениться на первой красавице – и при этом остаться безупречным джентльменом?',
    image:'https://cv2.litres.ru/pub/c/audiokniga/cover_415/173522-zhul-vern-vokrug-sveta-za-80-dney-spektakl-173522.jpg',
    categoryId:4
},
];

export interface Product{
  id: number;
  categoryId: number;
  url: string;
  name: string;
  image: string;
  description: string;
}
